{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "special": true,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false
        }
    ],
    "normalizer": null,
    "pre_tokenizer": {
        "type": "Whitespace"
    },
    "post_processor": null,
    "decoder": null,
    "model": {
        "type": "BPE",
        "dropout": null,
        "unk_token": null,
        "continuing_subword_prefix": null,
        "end_of_word_suffix": null,
        "fuse_unk": false,
        "vocab": {
            "[PAD]": 0,
            "#": 1,
            "%": 2,
            "(": 3,
            ")": 4,
            "+": 5,
            "-": 6,
            ".": 7,
            "/": 8,
            "0": 9,
            "1": 10,
            "2": 11,
            "3": 12,
            "4": 13,
            "5": 14,
            "6": 15,
            "7": 16,
            "8": 17,
            "9": 18,
            "=": 19,
            "@": 20,
            "B": 21,
            "C": 22,
            "F": 23,
            "H": 24,
            "I": 25,
            "N": 26,
            "O": 27,
            "P": 28,
            "S": 29,
            "[": 30,
            "\\": 31,
            "]": 32,
            "a": 33,
            "c": 34,
            "i": 35,
            "l": 36,
            "n": 37,
            "o": 38,
            "r": 39,
            "s": 40,
            "CC": 41,
            "cc": 42,
            "](": 43,
            "(=": 44,
            ")[": 45,
            "@@": 46,
            "NC": 47,
            "c1": 48,
            "c2": 49,
            "CCC": 50,
            "cccc": 51,
            "OC": 52,
            "ccc": 53,
            ")=": 54,
            "CO": 55,
            "CCCC": 56,
            "Cc1": 57,
            "c3": 58,
            "ccccc1": 59,
            "CCCN": 60,
            "1C": 61,
            ")(": 62,
            "@]": 63,
            "cc1": 64,
            "@@]": 65,
            "nH": 66,
            "CCCCN": 67,
            "CCCNC": 68,
            "2C": 69,
            "ccccc2": 70,
            "CNC": 71,
            "c4": 72,
            "c2ccccc2": 73,
            "cc2": 74,
            "c2ccc": 75,
            "c1ccc": 76,
            "nc": 77,
            "Cl": 78,
            "3O": 79,
            "Cc1ccccc1": 80,
            "Cc1c": 81,
            "CCN": 82,
            "Cc1ccc": 83,
            "CN": 84,
            "6O": 85,
            "OCC": 86,
            "]([": 87,
            "C1": 88,
            "2O": 89,
            "1O": 90,
            "c2c": 91,
            "N1": 92,
            "NCC": 93,
            "3C": 94,
            "n1": 95,
            ")(=": 96,
            "ccccc12": 97,
            "(-": 98,
            "c1cc": 99,
            "c2ccccc12": 100,
            "ccccc3": 101,
            "CS": 102,
            "CC1": 103,
            "c1ccccc1": 104,
            "Cc2ccccc2": 105,
            "C2": 106,
            ")/": 107,
            "NC1": 108,
            "4O": 109,
            "c2cc": 110,
            "-]": 111,
            "1CCCN": 112,
            "c3ccccc3": 113,
            "1CCCN1C": 114,
            "1CC": 115,
            "3CC": 116,
            "7O": 117,
            "COC": 118,
            "c5": 119,
            "c3ccc": 120,
            "C3": 121,
            "n2": 122,
            "N1CCC": 123,
            "5O": 124,
            "SC": 125,
            "4CC": 126,
            "N2": 127,
            "cc3": 128,
            "Br": 129,
            "12": 130,
            "Cc2ccc": 131,
            "c3c": 132,
            "OCCOCC": 133,
            "([": 134,
            "@](": 135,
            "CCCCCCCC": 136,
            "CCCN2C": 137,
            "2CCCN2C": 138,
            "nc1": 139,
            "CC2": 140,
            "c1cccc": 141,
            "ccccc4": 142,
            "+](": 143,
            "1NC": 144,
            "4C": 145,
            "Cc2c": 146,
            "@@](": 147,
            ".[": 148,
            "2CC": 149,
            "5C": 150,
            "8O": 151,
            "c6": 152,
            "cn": 153,
            "Cc1cc": 154,
            "c4ccccc4": 155,
            "-])": 156,
            "cn1": 157,
            "c2c1": 158,
            "c3cc": 159,
            "(/": 160,
            "+]": 161,
            "5CC": 162,
            "O2": 163,
            "CCCCNC": 164,
            "(\\": 165,
            "14": 166,
            "2OC": 167,
            "c1n": 168,
            "COP": 169,
            "COc1cc": 170,
            "c4cc": 171,
            "3OC": 172,
            "]%": 173,
            "CCCCC": 174,
            "ccc1": 175,
            "c1c": 176,
            "c1cc2": 177,
            "c2cccc": 178,
            "ccccc23": 179,
            "CSCC": 180,
            "SSC": 181,
            "CCNC": 182,
            "6OC": 183,
            "O1": 184,
            "Oc1ccc": 185,
            "nc2": 186,
            "s1": 187,
            "sc": 188,
            "c1nc": 189,
            "c3ccccc23": 190,
            "N2CCC": 191,
            "+](=": 192,
            "3c": 193,
            "N3": 194,
            "nn": 195,
            "CCSC": 196,
            "cc4": 197,
            "ccc2": 198,
            "c4c": 199,
            "c5cccc": 200,
            ")-": 201,
            "1OC": 202,
            "12C": 203,
            "4OC": 204,
            "5c": 205,
            "5OC": 206,
            "C4": 207,
            "Na": 208,
            "NCCCC": 209,
            "Nc1ccc": 210,
            "NCCN": 211,
            "O4": 212,
            "c8": 213,
            "CC3": 214,
            "OC1": 215,
            "c1cccnc1": 216,
            "c1cc2c": 217,
            "c5ccccc5": 218,
            "10": 219,
            "C2C": 220,
            "Cn1": 221,
            "Cc3ccc": 222,
            "Oc2ccc": 223,
            "oc2": 224,
            "c2nc": 225,
            "ccc3": 226,
            "COCC": 227,
            "COc1ccc": 228,
            "c3cccc": 229,
            "c4ccc": 230,
            "N1CCN": 231,
            "OCCOCCOCCOCC": 232,
            "11": 233,
            "21": 234,
            "2NC": 235,
            "21C": 236,
            "3CCCN": 237,
            "6CC": 238,
            "NCCC": 239,
            "o1": 240,
            "OCc1ccccc1": 241,
            "CCCCCC": 242,
            "Cc1cccc": 243,
            "1CSSC": 244,
            "c4ccccc3": 245,
            "ncn": 246,
            "CN1C": 247,
            "OCC1": 248,
            "CSSC": 249,
            "c4ccccc34": 250,
            "23": 251,
            "34": 252,
            "6C": 253,
            "Cc3c": 254,
            "NO": 255,
            "NS": 256,
            "O3": 257,
            "OP": 258,
            "\\[": 259,
            "cn2": 260,
            "cc5": 261,
            "c1O": 262,
            "c1OC": 263,
            "c2n": 264,
            "CCC2": 265,
            ")([": 266,
            "CNC2": 267,
            "c2ccccc21": 268,
            "c2ccccc2c1": 269,
            "Cc1cnc": 270,
            "CCN1": 271,
            "CN1": 272,
            "c2csc": 273,
            "3CCCN3C": 274,
            "/[": 275,
            "2c": 276,
            "32C": 277,
            "3ccccc3": 278,
            "7C": 279,
            "C1C": 280,
            "Cc3ccccc3": 281,
            "C5C": 282,
            "N1C": 283,
            "OS": 284,
            "c7": 285,
            "oc": 286,
            "CCOC": 287,
            "ccn": 288,
            "cc1C": 289,
            "OCc2ccccc2": 290,
            "COc1ccccc1": 291,
            "COc1cc2c": 292,
            "2C1": 293,
            "2CN": 294,
            "3OO4": 295,
            "C1CC": 296,
            "c2ccn": 297,
            "-])[": 298,
            "-].[": 299,
            "COC1": 300,
            "c2cccc3": 301,
            "13": 302,
            "1CO": 303,
            "15c": 304,
            "23C": 305,
            "3nc": 306,
            "34C": 307,
            "43C": 308,
            "45C": 309,
            "C5": 310,
            "C4C": 311,
            "Nc1n": 312,
            "Nc1nc": 313,
            "O5": 314,
            "Oc1cc": 315,
            "SCC": 316,
            "c9": 317,
            "cnc": 318,
            "no": 319,
            "nc3": 320,
            "nc2c1": 321,
            "CC4": 322,
            "CC5": 323,
            "NCc2ccccc2": 324,
            "NCc1ccccc1": 325,
            "c12": 326,
            "c2O": 327,
            "ccc4O": 328,
            "CCCC1": 329,
            "CCCCCCC": 330,
            "c3C": 331,
            "c3O": 332,
            "c3c2": 333,
            "c3cc2": 334,
            "cc1O": 335,
            "2Cl": 336,
            "c4cccc": 337,
            "cc21": 338,
            "OCC2": 339,
            "OCCNC": 340,
            "N1CC": 341,
            "n1cc": 342,
            "c1ccc2c": 343,
            "c3ccccc32": 344,
            "N2CCN": 345,
            "CCCCCCCCCCCC": 346,
            "2CCCCC2": 347,
            "Cc1ccc2ccccc2c1": 348,
            "CCCCC1": 349,
            "ccc1O": 350,
            "Cn1cc": 351,
            "oc2C": 352,
            "3ccccc3c2": 353,
            "c3cc2cc": 354,
            "16": 355,
            "1CCC": 356,
            "1Cc1ccc": 357,
            "13c": 358,
            "1ccn": 359,
            "23OO4": 360,
            "3CCC": 361,
            "3CO": 362,
            "45": 363,
            "4ccccc4": 364,
            "5n": 365,
            "7CC": 366,
            "8OC": 367,
            "C7": 368,
            "C3C": 369,
            "N4": 370,
            "N5": 371,
            "NN": 372,
            "N2C": 373,
            "Nc2ccccc2": 374,
            "Nc2cccc": 375,
            "Nc2nc": 376,
            "ON": 377,
            "OCCCC": 378,
            "Oc3ccc": 379,
            "Oc3cc2cc": 380,
            "SS": 381,
            "cs": 382,
            "cs1": 383,
            "n3": 384,
            "ncc": 385,
            "n1C": 386,
            "nn1": 387,
            "nn2": 388,
            "CCO": 389,
            "CCc1c": 390,
            "CCOCCOCCOCCOCC": 391,
            "cc7": 392,
            "cc2Cl": 393,
            "NC2": 394,
            "NCc1ccc": 395,
            "c1C": 396,
            "c1s": 397,
            "OC3": 398,
            "OCc2ccc": 399,
            "COS": 400,
            "CCCCCCCCC": 401,
            "c3nc": 402,
            "ccccc13": 403,
            "1CN": 404,
            "cc1OC": 405,
            "2CSSC": 406,
            "c4cc3": 407,
            "cc23": 408,
            "cc2c": 409,
            "c2ccc3": 410,
            "c2ccc3c": 411,
            "CCN1C": 412,
            "CN1CC": 413,
            "3C2": 414,
            "3C3": 415,
            "c1ccn": 416,
            "3CC4CC": 417,
            "c5c": 418,
            "c5cc": 419,
            "12c": 420,
            "12CC": 421,
            "Cc2ccc3ccccc3c2": 422,
            "c3cs": 423,
            "CCCCCCCCCC": 424,
            "2CCCN2C1": 425,
            "c1ccccn1": 426,
            "c1cccc2c": 427,
            "Cc2cnc": 428,
            "c6cccc": 429,
            "+].[": 430,
            "COc1ccc2c": 431,
            "c2ccccn2": 432,
            "ccc21": 433,
            "ccc23": 434,
            "ncn2C": 435,
            "c1OCCCCNC": 436,
            "COc1ccccc1N1CCN": 437,
            "cs3": 438,
            "CCOCCOCCOCCOCCNC": 439,
            "c4cc3ccc4O": 440,
            "17": 441,
            "18": 442,
            "19": 443,
            "1N": 444,
            "1CCCC": 445,
            "1CCCNC": 446,
            "13O": 447,
            "1c2c": 448,
            "1CCCCCCCCCC": 449,
            "20": 450,
            "2cc": 451,
            "2CCC": 452,
            "2CO": 453,
            "2CCN": 454,
            "2c3cc": 455,
            "32": 456,
            "3N": 457,
            "3cc": 458,
            "4F": 459,
            "4c": 460,
            "5CN": 461,
            "53OO4": 462,
            "6CN": 463,
            "64O": 464,
            "9C": 465,
            "9O": 466,
            "Cc2cc": 467,
            "C3CC": 468,
            "N6": 469,
            "NOC": 470,
            "NCCCN": 471,
            "NCCCCN": 472,
            "Nc1ccccc1": 473,
            "N3CC": 474,
            "Nc3c": 475,
            "NCCCCCCCC": 476,
            "Nc1ccc2c": 477,
            "OCCC": 478,
            "Oc2c": 479,
            "Oc1ccccc1": 480,
            "Oc2n": 481,
            "Si": 482,
            "Sc1n": 483,
            "n6": 484,
            "nnc": 485,
            "n3C": 486,
            "o4": 487,
            "oc4c": 488,
            "oc3c2": 489,
            "CC2C": 490,
            "CCc1ccc": 491,
            "CCn1": 492,
            "CCc1ccccc1": 493,
            "CCOCCOCC": 494,
            "CCOc1ccc": 495,
            "CCc8": 496,
            "NC5": 497,
            "c1sc": 498,
            "c23": 499,
            "c2nn": 500,
            "CCCl": 501,
            "cccc2": 502,
            "cccc34": 503,
            "OC5": 504,
            "OCc1ccc": 505,
            "OCO3": 506,
            "COc3ccccc3": 507,
            "COc1cccc": 508,
            "COc1c": 509,
            "CCCC2": 510,
            "CCCCCCCN": 511,
            "Cc1cc2c": 512,
            "c3ccccc13": 513,
            "CCCN1CC": 514,
            "1C2": 515,
            "1Cc2c": 516,
            "@]%": 517,
            "cc12": 518,
            "cc1Nc1nc": 519,
            "2C3": 520,
            "2COC": 521,
            "c4C": 522,
            "c4nc": 523,
            "c4c5c": 524,
            "cc2OC": 525,
            "cc2c2cc": 526,
            "c2cccnc2": 527,
            "nc8": 528,
            "3O1": 529,
            "Cc1cn": 530,
            "CCN3CC": 531,
            "Cc1cccnc1": 532,
            "Cc1ccco1": 533,
            "CN2C": 534,
            "OCC3": 535,
            "OCC5": 536,
            "OCCc2ccccc2": 537,
            "OCC2CCCCC2": 538,
            "C1NC": 539,
            "c2cn": 540,
            "NCCSS": 541,
            "n1cn": 542,
            "c1ccc2": 543,
            "CC1CC": 544,
            "CC1CCN": 545,
            "c2cc3c": 546,
            "-].": 547,
            "c3ccccc3c2": 548,
            "c3ccccc3nc1": 549,
            "c5ccc": 550,
            "c5c6": 551,
            "c3cccnc3": 552,
            "n2cc": 553,
            "12CO": 554,
            "CCCCCCCCCCCCCCCC": 555,
            "nc1N": 556,
            "4C4": 557,
            "2CC4": 558,
            "2CCOCC2": 559,
            "c6cc": 560,
            "c6ccc": 561,
            "cn3": 562,
            "cn1C": 563,
            "c4ccccc4C3": 564,
            "c2c1ncn2C": 565,
            "c3ccn": 566,
            "14c": 567,
            "14cc": 568,
            "c1n3": 569,
            "c1no": 570,
            "ccc1C": 571,
            "N2CCCc2cc": 572,
            "N3CCC": 573,
            "N3CCN": 574,
            "cc4Cl": 575,
            "NCCN3": 576,
            "c8c": 577,
            "c1cccnc1N": 578,
            "10c": 579,
            "Cn1c": 580,
            "COCCP": 581,
            "OCCOCCOCCOCCOCCOCCOCCOCC": 582,
            "11c": 583,
            "21c": 584,
            "OCC1c2ccccc2": 585,
            "34CCC": 586,
            "cc5N": 587,
            "CCN1CCN": 588,
            "CN1CCN": 589,
            "3CCCN3C2": 590,
            "C1C2": 591,
            "c7ccc": 592,
            "c7c8": 593,
            "cc1Cl": 594,
            "c2ccncc2": 595,
            "c2ccnc3cc": 596,
            "c2cccc3ccccc23": 597,
            "45CCC": 598,
            "c2ccc3cc2c2cc": 599,
            "c3csc1n3": 600,
            "c6ccccc6": 601,
            "64OO5": 602,
            "Cc2ccoc2": 603,
            "C3CC3": 604,
            "CC2C4": 605,
            "CCn1c2ccc3cc2c2cc": 606,
            "CCOCCOCCOCCNC": 607,
            "CCc8c6": 608,
            "NCCSSCCNC": 609,
            "c3ccccc3nc12": 610,
            "+]([": 611,
            "-%": 612,
            "1S": 613,
            "1n": 614,
            "1Cc1": 615,
            "1CCN": 616,
            "12O": 617,
            "11O": 618,
            "1CC1": 619,
            "14O": 620,
            "1c2cc": 621,
            "1CCCCNC": 622,
            "13OC": 623,
            "16OC": 624,
            "15OC": 625,
            "1CCCC1": 626,
            "15n": 627,
            "24": 628,
            "22C": 629,
            "2c1ccc": 630,
            "23O": 631,
            "21O": 632,
            "2NCC": 633,
            "2CC1": 634,
            "23CC": 635,
            "23c": 636,
            "24OC": 637,
            "2c3cccc": 638,
            "22c": 639,
            "2CCCC2": 640,
            "3NC": 641,
            "3cccc": 642,
            "3c4": 643,
            "3c2ccccc2": 644,
            "3C1": 645,
            "35CC": 646,
            "34OC": 647,
            "4cc": 648,
            "4NC": 649,
            "4ccc": 650,
            "4CCCN": 651,
            "4CCN": 652,
            "4Cc1ccc": 653,
            "4COP": 654,
            "4N3": 655,
            "46CC": 656,
            "53": 657,
            "5NC": 658,
            "5c4": 659,
            "5nc": 660,
            "5CCN": 661,
            "54O": 662,
            "56C": 663,
            "65": 664,
            "6c": 665,
            "7N": 666,
            "7OC": 667,
            "76O": 668,
            "7c6": 669,
            "7cnc": 670,
            "86": 671,
            "8c": 672,
            "8ccc": 673,
            "89C": 674,
            "9cc": 675,
            "9cnc": 676,
            "=[": 677,
            "Cn": 678,
            "Cc3": 679,
            "C6O": 680,
            "Cc5": 681,
            "Cn2": 682,
            "C5O": 683,
            "Cc4ccccc4": 684,
            "C5CC": 685,
            "Cc5ccccc5": 686,
            "Cc3cccc": 687,
            "C6CC": 688,
            "Cc2cccc3ccccc23": 689,
            "Fc1ccc": 690,
            "NNC": 691,
            "Nc3": 692,
            "Nc2ccc": 693,
            "Nc2cc": 694,
            "Nc3ccccc3": 695,
            "Nc3ccc": 696,
            "Nc1cccc": 697,
            "Nc4ccccc4": 698,
            "N5CC": 699,
            "NO2": 700,
            "Nc4c": 701,
            "Nc3cccc": 702,
            "N2C1": 703,
            "Nc3ccccc32": 704,
            "NCCCCCCCCCCCC": 705,
            "Nc3nc": 706,
            "Nc2ccc3c": 707,
            "Nc2ccnc3cc": 708,
            "O6": 709,
            "O8": 710,
            "Oc2ccccc2": 711,
            "Oc4ccccc4": 712,
            "Oc3cc": 713,
            "OCCCCNC": 714,
            "Oc1n": 715,
            "Oc4c": 716,
            "OOC1": 717,
            "Oc4ccc": 718,
            "OCCCN1CC": 719,
            "OCCN1CCN": 720,
            "Oc7c8": 721,
            "S1": 722,
            "SC1": 723,
            "SCC1": 724,
            "Sc1ccccc1": 725,
            "Sc1ccccn1": 726,
            "Sc4ccccc4C3": 727,
            "]/": 728,
            "n4": 729,
            "ns": 730,
            "nc2cc": 731,
            "nc3c": 732,
            "nnc1": 733,
            "nc3ccccc23": 734,
            "n3c": 735,
            "ncc4": 736,
            "nc4c": 737,
            "nc3cccc": 738,
            "no1": 739,
            "nccn": 740,
            "nc4c5c": 741,
            "nc3ccn": 742,
            "n7cnc": 743,
            "n8ccc": 744,
            "n9cnc": 745,
            "o2": 746,
            "o3": 747,
            "o6": 748,
            "oc4": 749,
            "onc": 750,
            "oc2ccccc12": 751,
            "oc2cc": 752,
            "oc4ccccc34": 753,
            "oc2ccccc2c1": 754,
            "s2": 755,
            "s5": 756,
            "scc": 757,
            "sc1": 758,
            "scn1": 759,
            "sc3ccccc23": 760,
            "sccc3": 761,
            "sc3c2": 762,
            "CCS": 763,
            "CCl": 764,
            "CC1C": 765,
            "CCCCCNC": 766,
            "CCc2ccccc2": 767,
            "CCc2ccc": 768,
            "CCc3ccccc3": 769,
            "CC3CC": 770,
            "CCc3ccc": 771,
            "CCO2": 772,
            "CCc1cc2c": 773,
            "CCOP": 774,
            "CCOc1cc": 775,
            "CCn1cc": 776,
            "CCc2ccc3c": 777,
            "CCc1ccn": 778,
            "CCc1ccccn1": 779,
            "CCc2nn": 780,
            "CCn3c": 781,
            "cc4C": 782,
            "ccc2c1": 783,
            "cc2C1": 784,
            "cc86": 785,
            "cc9cc": 786,
            "](/": 787,
            "NC3": 788,
            "NC4": 789,
            "NCP": 790,
            "NC2C": 791,
            "NCc3ccccc3": 792,
            "NCN2": 793,
            "NCc3c": 794,
            "NC21": 795,
            "NCc2ccc3c": 796,
            "NCc4nc": 797,
            "NC2CCOCC2": 798,
            "NCc2cccc3ccccc23": 799,
            "c13": 800,
            "c1F": 801,
            "c1Cc1ccccc1": 802,
            "c1ccccc12": 803,
            "c1C2": 804,
            "c1Br": 805,
            "c1cn": 806,
            "c1NCCN": 807,
            "c1oc": 808,
            "c1oc2ccccc2c1": 809,
            "c2F": 810,
            "c2C1": 811,
            "c2C3": 812,
            "c2c3c": 813,
            "c2nc1": 814,
            "c2sc": 815,
            "c2O4": 816,
            "c2cc1O": 817,
            "c2cc1OC": 818,
            "CCC1": 819,
            "CCC3": 820,
            "CCCc2ccccc2": 821,
            "CCCc1ccc": 822,
            "CCCn1": 823,
            "CCCc1ccccc1": 824,
            "CCCO2": 825,
            "CCCc1c": 826,
            "CCCOP": 827,
            "CCC2CCCCC2": 828,
            "CCCON": 829,
            "CCCSc1n": 830,
            "CCCc5ccc": 831,
            "CCCc1cn": 832,
            "cccc3": 833,
            "cccc1C": 834,
            "cccc12": 835,
            "ccccc8": 836,
            "cccc2Cl": 837,
            "cccc45": 838,
            "cccc5n": 839,
            "cccc4F": 840,
            "cccc53": 841,
            "OC2": 842,
            "OC4": 843,
            "OCO": 844,
            "OC6O": 845,
            "OC4O": 846,
            "OCc2cc": 847,
            "OCc3ccccc3": 848,
            "OC1CC": 849,
            "OC7O": 850,
            "OCc3ccc": 851,
            "OCc1cccc": 852,
            "OC2CC": 853,
            "OCc3cc": 854,
            "OCO2": 855,
            "OC2OC": 856,
            "OCc4cc": 857,
            "OC3OC": 858,
            "OCc1c": 859,
            "OC5OC": 860,
            "OCO4": 861,
            "OCc5ccccc5": 862,
            "OCc2nc": 863,
            "OC6C": 864,
            "OCO5": 865,
            "OCOc2n": 866,
            "OCc2cn": 867,
            "ccc6": 868,
            "ccc3CC": 869,
            "ccc4F": 870,
            "ccc9O": 871,
            "ccc4N3": 872,
            "CO3": 873,
            "CO9": 874,
            "COc1cc2": 875,
            "COc2cccc3": 876,
            "COc2ccc3": 877,
            "COc1no": 878,
            "CCCC3": 879,
            "CCCCl": 880,
            "CCCCOC": 881,
            "CCCC1C": 882,
            "CCCCNC1": 883,
            "CCCCCC2": 884,
            "CCCCOP": 885,
            "CCCCc1oc2ccccc2c1": 886,
            "Cc1c2c": 887,
            "Cc1cc3": 888,
            "Cc1nc2": 889,
            "Cc1no": 890,
            "c32": 891,
            "c3CO": 892,
            "c3Cl": 893,
            "c3n1": 894,
            "c3c2cc": 895,
            "c3n2": 896,
            "c3c4ccccc4": 897,
            "c3c1c": 898,
            "c3c1O": 899,
            "c3oc4c": 900,
            "c3c4c5c": 901,
            "c3OCC5": 902,
            "c3ns": 903,
            "c3sccc3": 904,
            "c3OC2OC": 905,
            "CCCNc2ccccn2": 906,
            "CCCN2CCC": 907,
            "CCCN1c2cc": 908,
            "1C1": 909,
            "1CNC": 910,
            "1COC": 911,
            "1C23C": 912,
            "cc1F": 913,
            "cc1S": 914,
            "cc1n": 915,
            "cc1OCc1ccccc1": 916,
            "cc1OCC1": 917,
            "cc1n3C": 918,
            "CCCCN2CCN": 919,
            "CCCCN1CCN": 920,
            "2C2": 921,
            "2C3C": 922,
            "2Cc3c": 923,
            "2CN2CCC": 924,
            "ccccc2s1": 925,
            "CNCc3cccc": 926,
            "CNC12CC": 927,
            "CNC1CC1": 928,
            "CNC7N": 929,
            "c4n": 930,
            "c4c5ccccc5": 931,
            "c4c3O": 932,
            "c4c3c2": 933,
            "c2ccccc2C": 934,
            "c2ccccc2F": 935,
            "c2ccccc2I": 936,
            "c2ccccc2S": 937,
            "c2ccccc2Cl": 938,
            "c2ccccc2n1": 939,
            "c2ccccc2s1": 940,
            "c2ccccc2o1": 941,
            "cc2c1": 942,
            "cc2cn": 943,
            "cc2o1": 944,
            "cc2c1OC": 945,
            "cc2c1s": 946,
            "cc2cc1OC": 947,
            "c2ccc3ccccc3c2": 948,
            "c1cccs1": 949,
            "c1ccco1": 950,
            "ncnc": 951,
            "ncn2": 952,
            "nc5C": 953,
            "ncs1": 954,
            "nc5c": 955,
            "3O7": 956,
            "Cc1ccccc1Nc1nc": 957,
            "Cc1csc": 958,
            "Cc1cscn1": 959,
            "CCNCC": 960,
            "CCN2C": 961,
            "CCN5C": 962,
            "CCNc1cccnc1": 963,
            "CCNc3ccn": 964,
            "CCN4CCN": 965,
            "CCNc3c4ccccc4": 966,
            "CCNc4c5ccccc5": 967,
            "CN4CC": 968,
            "CNc1n": 969,
            "CNc1nc": 970,
            "CNc2n": 971,
            "CN2C1": 972,
            "CN2CCCCC2": 973,
            "CN3CCC": 974,
            "CN2CCC": 975,
            "CN2CCCC2": 976,
            "OCC4": 977,
            "OCCO2": 978,
            "OCCc2nc": 979,
            "OCCOc3ccc": 980,
            "OCC1CN": 981,
            "C12": 982,
            "C1O": 983,
            "C1c1ccc": 984,
            "C1NCC": 985,
            "C1Br": 986,
            "C1c1c": 987,
            "1OP": 988,
            "c2c5c": 989,
            "c2coc": 990,
            "c2cncn2C": 991,
            "N1CCCC1": 992,
            "NCCS": 993,
            "NCCc1ccccc1": 994,
            "NCCOCCOCC": 995,
            "NCCc1cccnc1": 996,
            "NCCn3": 997,
            "NCCc3c2cc": 998,
            "3COC": 999,
            "3CSSC": 1000,
            "n12": 1001,
            "n1S": 1002,
            "n1c": 1003,
            "n1Cc1c": 1004,
            "c1ccc2ccc": 1005,
            "c1ccc2cc": 1006,
            "c1ccc2n": 1007,
            "c1cc4ccccc4": 1008,
            "ccccc3nc1": 1009,
            "CSc1cc": 1010,
            "CSc1n": 1011,
            "CSC1CC": 1012,
            "CSc1sc": 1013,
            "CC1OC": 1014,
            "CC1CC1": 1015,
            "CC1c3c": 1016,
            "c1ccccc1n2": 1017,
            "c1ccccc1N3": 1018,
            "c1ccccc1c2C1": 1019,
            "C2CC2": 1020,
            "C24OC": 1021,
            "C23CC4CC": 1022,
            "C2CC3CC": 1023
        },
        "merges": [
            "C C",
            "c c",
            "] (",
            "( =",
            ") [",
            "@ @",
            "N C",
            "c 1",
            "c 2",
            "CC C",
            "cc cc",
            "O C",
            "cc c",
            ") =",
            "C O",
            "CC CC",
            "C c1",
            "c 3",
            "cccc c1",
            "CCC N",
            "1 C",
            ") (",
            "@ ]",
            "cc 1",
            "@@ ]",
            "n H",
            "CCCC N",
            "CCC NC",
            "2 C",
            "cccc c2",
            "C NC",
            "c 4",
            "c2 ccccc2",
            "cc 2",
            "c2 ccc",
            "c1 ccc",
            "n c",
            "C l",
            "3 O",
            "Cc1 ccccc1",
            "Cc1 c",
            "CC N",
            "Cc1 ccc",
            "C N",
            "6 O",
            "O CC",
            "]( [",
            "C 1",
            "2 O",
            "1 O",
            "c2 c",
            "N 1",
            "N CC",
            "3 C",
            "n 1",
            ") (=",
            "ccccc1 2",
            "( -",
            "c1 cc",
            "c2 ccccc12",
            "cccc c3",
            "C S",
            "CC 1",
            "c1 ccccc1",
            "C c2ccccc2",
            "C 2",
            ") /",
            "NC 1",
            "4 O",
            "c2 cc",
            "- ]",
            "1 CCCN",
            "c3 ccccc3",
            "1CCCN 1C",
            "1 CC",
            "3 CC",
            "7 O",
            "C OC",
            "c 5",
            "c3 ccc",
            "C 3",
            "n 2",
            "N1 CCC",
            "5 O",
            "S C",
            "4 CC",
            "N 2",
            "cc 3",
            "B r",
            "1 2",
            "C c2ccc",
            "c3 c",
            "OCC OCC",
            "( [",
            "@ ](",
            "CCCC CCCC",
            "CCCN 2C",
            "2 CCCN2C",
            "n c1",
            "CC 2",
            "c1 cccc",
            "cccc c4",
            "+ ](",
            "1 NC",
            "4 C",
            "C c2c",
            "@@ ](",
            ". [",
            "2 CC",
            "5 C",
            "8 O",
            "c 6",
            "c n",
            "Cc1 cc",
            "c4 ccccc4",
            "-] )",
            "c n1",
            "c2 c1",
            "c3 cc",
            "( /",
            "+ ]",
            "5 CC",
            "O 2",
            "CCCC NC",
            "( \\",
            "1 4",
            "2 OC",
            "c1 n",
            "CO P",
            "CO c1cc",
            "c4 cc",
            "3 OC",
            "] %",
            "CC CCC",
            "cc c1",
            "c1 c",
            "c1 cc2",
            "c2 cccc",
            "ccccc2 3",
            "CS CC",
            "S SC",
            "CC NC",
            "6 OC",
            "O 1",
            "O c1ccc",
            "n c2",
            "s 1",
            "s c",
            "c1 nc",
            "c3 ccccc23",
            "N2 CCC",
            "+]( =",
            "3 c",
            "N 3",
            "n n",
            "CC SC",
            "cc 4",
            "cc c2",
            "c4 c",
            "c5 cccc",
            ") -",
            "1 OC",
            "1 2C",
            "4 OC",
            "5 c",
            "5 OC",
            "C 4",
            "N a",
            "N CCCC",
            "N c1ccc",
            "N CCN",
            "O 4",
            "c 8",
            "CC 3",
            "OC 1",
            "c1ccc nc1",
            "c1cc2 c",
            "c5cccc c5",
            "1 0",
            "C 2C",
            "C n1",
            "C c3ccc",
            "O c2ccc",
            "o c2",
            "c2 nc",
            "ccc 3",
            "CO CC",
            "CO c1ccc",
            "c3 cccc",
            "c4 ccc",
            "N1 CCN",
            "OCCOCC OCCOCC",
            "1 1",
            "2 1",
            "2 NC",
            "2 1C",
            "3 CCCN",
            "6 CC",
            "N CCC",
            "o 1",
            "OC c1ccccc1",
            "CCCC CC",
            "Cc1 cccc",
            "1C SSC",
            "c4 ccccc3",
            "nc n",
            "CN 1C",
            "OCC 1",
            "CS SC",
            "c4ccccc3 4",
            "2 3",
            "3 4",
            "6 C",
            "C c3c",
            "N O",
            "N S",
            "O 3",
            "O P",
            "\\ [",
            "c n2",
            "cc 5",
            "c1 O",
            "c1 OC",
            "c2 n",
            "CCC 2",
            ")( [",
            "CNC 2",
            "c2ccccc2 1",
            "c2ccccc2 c1",
            "Cc1c nc",
            "CCN 1",
            "CN 1",
            "c2c sc",
            "3CCCN 3C",
            "/ [",
            "2 c",
            "3 2C",
            "3 ccccc3",
            "7 C",
            "C 1C",
            "C c3ccccc3",
            "C 5C",
            "N 1C",
            "O S",
            "c 7",
            "o c",
            "CC OC",
            "cc n",
            "cc 1C",
            "OC c2ccccc2",
            "CO c1ccccc1",
            "CO c1cc2c",
            "2C 1",
            "2C N",
            "3O O4",
            "C1 CC",
            "c2cc n",
            "-] )[",
            "-] .[",
            "COC 1",
            "c2cccc 3",
            "1 3",
            "1 CO",
            "1 5c",
            "2 3C",
            "3 nc",
            "3 4C",
            "4 3C",
            "4 5C",
            "C 5",
            "C 4C",
            "N c1n",
            "N c1nc",
            "O 5",
            "O c1cc",
            "S CC",
            "c 9",
            "c nc",
            "n o",
            "n c3",
            "n c2c1",
            "CC 4",
            "CC 5",
            "NC c2ccccc2",
            "NC c1ccccc1",
            "c1 2",
            "c2 O",
            "ccc 4O",
            "CCCC 1",
            "CCCC CCC",
            "c3 C",
            "c3 O",
            "c3 c2",
            "c3 cc2",
            "cc1 O",
            "2C l",
            "c4 cccc",
            "cc2 1",
            "OCC 2",
            "OCC NC",
            "N1 CC",
            "n1 cc",
            "c1cc c2c",
            "c3ccccc3 2",
            "N2 CCN",
            "CCCCCCCC CCCC",
            "2CC CCC2",
            "Cc1cc c2ccccc2c1",
            "CCCCC 1",
            "ccc1 O",
            "Cn1 cc",
            "oc2 C",
            "3ccccc3 c2",
            "c3cc2 cc",
            "1 6",
            "1 CCC",
            "1 Cc1ccc",
            "1 3c",
            "1 ccn",
            "2 3OO4",
            "3 CCC",
            "3 CO",
            "4 5",
            "4 ccccc4",
            "5 n",
            "7 CC",
            "8 OC",
            "C 7",
            "C 3C",
            "N 4",
            "N 5",
            "N N",
            "N 2C",
            "N c2ccccc2",
            "N c2cccc",
            "N c2nc",
            "O N",
            "O CCCC",
            "O c3ccc",
            "O c3cc2cc",
            "S S",
            "c s",
            "c s1",
            "n 3",
            "n cc",
            "n 1C",
            "n n1",
            "n n2",
            "CC O",
            "CC c1c",
            "CC OCCOCCOCCOCC",
            "cc 7",
            "cc 2Cl",
            "NC 2",
            "NC c1ccc",
            "c1 C",
            "c1 s",
            "OC 3",
            "OC c2ccc",
            "CO S",
            "CCCC CCCCC",
            "c3 nc",
            "ccccc1 3",
            "1C N",
            "cc1 OC",
            "2C SSC",
            "c4 cc3",
            "cc2 3",
            "cc2 c",
            "c2ccc 3",
            "c2ccc 3c",
            "CCN 1C",
            "CN 1CC",
            "3C 2",
            "3C 3",
            "c1cc n",
            "3CC 4CC",
            "c5 c",
            "c5 cc",
            "12 c",
            "12 CC",
            "Cc2ccc 3ccccc3c2",
            "c3c s",
            "CCCCCCCC CC",
            "2CCCN2C 1",
            "c1cccc n1",
            "c1cccc 2c",
            "Cc2c nc",
            "c6 cccc",
            "+] .[",
            "COc1cc c2c",
            "c2cccc n2",
            "ccc2 1",
            "ccc2 3",
            "ncn 2C",
            "c1O CCCCNC",
            "COc1ccccc1 N1CCN",
            "cs 3",
            "CCOCCOCCOCCOCC NC",
            "c4cc3 ccc4O",
            "1 7",
            "1 8",
            "1 9",
            "1 N",
            "1 CCCC",
            "1 CCCNC",
            "1 3O",
            "1 c2c",
            "1 CCCCCCCCCC",
            "2 0",
            "2 cc",
            "2 CCC",
            "2 CO",
            "2 CCN",
            "2 c3cc",
            "3 2",
            "3 N",
            "3 cc",
            "4 F",
            "4 c",
            "5 CN",
            "5 3OO4",
            "6 CN",
            "6 4O",
            "9 C",
            "9 O",
            "C c2cc",
            "C 3CC",
            "N 6",
            "N OC",
            "N CCCN",
            "N CCCCN",
            "N c1ccccc1",
            "N 3CC",
            "N c3c",
            "N CCCCCCCC",
            "N c1ccc2c",
            "O CCC",
            "O c2c",
            "O c1ccccc1",
            "O c2n",
            "S i",
            "S c1n",
            "n 6",
            "n nc",
            "n 3C",
            "o 4",
            "o c4c",
            "o c3c2",
            "CC 2C",
            "CC c1ccc",
            "CC n1",
            "CC c1ccccc1",
            "CC OCCOCC",
            "CC Oc1ccc",
            "CC c8",
            "NC 5",
            "c1 sc",
            "c2 3",
            "c2 nn",
            "CCC l",
            "cccc 2",
            "cccc 34",
            "OC 5",
            "OC c1ccc",
            "OC O3",
            "CO c3ccccc3",
            "CO c1cccc",
            "CO c1c",
            "CCCC 2",
            "CCCC CCCN",
            "Cc1 cc2c",
            "c3 ccccc13",
            "CCCN 1CC",
            "1C 2",
            "1C c2c",
            "@] %",
            "cc1 2",
            "cc1 Nc1nc",
            "2C 3",
            "2C OC",
            "c4 C",
            "c4 nc",
            "c4 c5c",
            "cc2 OC",
            "cc2 c2cc",
            "c2ccc nc2",
            "nc 8",
            "3O 1",
            "Cc1c n",
            "CCN 3CC",
            "Cc1ccc nc1",
            "Cc1ccc o1",
            "CN 2C",
            "OCC 3",
            "OCC 5",
            "OCC c2ccccc2",
            "OCC 2CCCCC2",
            "C1 NC",
            "c2c n",
            "NCC SS",
            "n1 cn",
            "c1cc c2",
            "CC1 CC",
            "CC1 CCN",
            "c2cc 3c",
            "-] .",
            "c3ccccc3 c2",
            "c3ccccc3 nc1",
            "c5 ccc",
            "c5 c6",
            "c3ccc nc3",
            "n2 cc",
            "12 CO",
            "CCCCCCCC CCCCCCCC",
            "nc1 N",
            "4C 4",
            "2CC 4",
            "2CC OCC2",
            "c6 cc",
            "c6 ccc",
            "cn 3",
            "cn 1C",
            "c4ccccc4 C3",
            "c2c1 ncn2C",
            "c3cc n",
            "14 c",
            "14 cc",
            "c1n 3",
            "c1n o",
            "ccc1 C",
            "N2CCC c2cc",
            "N3 CCC",
            "N3 CCN",
            "cc4 Cl",
            "NCCN 3",
            "c8 c",
            "c1cccnc1 N",
            "10 c",
            "Cn1 c",
            "COCC P",
            "OCCOCCOCCOCC OCCOCCOCCOCC",
            "11 c",
            "21 c",
            "OCC1 c2ccccc2",
            "34 CCC",
            "cc5 N",
            "CCN1 CCN",
            "CN1 CCN",
            "3CCCN3C 2",
            "C1C 2",
            "c7 ccc",
            "c7 c8",
            "cc1C l",
            "c2ccn cc2",
            "c2ccn c3cc",
            "c2cccc3 ccccc23",
            "45 CCC",
            "c2ccc3 cc2c2cc",
            "c3cs c1n3",
            "c6cccc c6",
            "64O O5",
            "Cc2cc oc2",
            "C3CC 3",
            "CC2C 4",
            "CCn1 c2ccc3cc2c2cc",
            "CCOCCOCC OCCNC",
            "CCc8 c6",
            "NCCSS CCNC",
            "c3ccccc3nc1 2",
            "+ ]([",
            "- %",
            "1 S",
            "1 n",
            "1 Cc1",
            "1 CCN",
            "1 2O",
            "1 1O",
            "1 CC1",
            "1 4O",
            "1 c2cc",
            "1 CCCCNC",
            "1 3OC",
            "1 6OC",
            "1 5OC",
            "1 CCCC1",
            "1 5n",
            "2 4",
            "2 2C",
            "2 c1ccc",
            "2 3O",
            "2 1O",
            "2 NCC",
            "2 CC1",
            "2 3CC",
            "2 3c",
            "2 4OC",
            "2 c3cccc",
            "2 2c",
            "2 CCCC2",
            "3 NC",
            "3 cccc",
            "3 c4",
            "3 c2ccccc2",
            "3 C1",
            "3 5CC",
            "3 4OC",
            "4 cc",
            "4 NC",
            "4 ccc",
            "4 CCCN",
            "4 CCN",
            "4 Cc1ccc",
            "4 COP",
            "4 N3",
            "4 6CC",
            "5 3",
            "5 NC",
            "5 c4",
            "5 nc",
            "5 CCN",
            "5 4O",
            "5 6C",
            "6 5",
            "6 c",
            "7 N",
            "7 OC",
            "7 6O",
            "7 c6",
            "7 cnc",
            "8 6",
            "8 c",
            "8 ccc",
            "8 9C",
            "9 cc",
            "9 cnc",
            "= [",
            "C n",
            "C c3",
            "C 6O",
            "C c5",
            "C n2",
            "C 5O",
            "C c4ccccc4",
            "C 5CC",
            "C c5ccccc5",
            "C c3cccc",
            "C 6CC",
            "C c2cccc3ccccc23",
            "F c1ccc",
            "N NC",
            "N c3",
            "N c2ccc",
            "N c2cc",
            "N c3ccccc3",
            "N c3ccc",
            "N c1cccc",
            "N c4ccccc4",
            "N 5CC",
            "N O2",
            "N c4c",
            "N c3cccc",
            "N 2C1",
            "N c3ccccc32",
            "N CCCCCCCCCCCC",
            "N c3nc",
            "N c2ccc3c",
            "N c2ccnc3cc",
            "O 6",
            "O 8",
            "O c2ccccc2",
            "O c4ccccc4",
            "O c3cc",
            "O CCCCNC",
            "O c1n",
            "O c4c",
            "O OC1",
            "O c4ccc",
            "O CCCN1CC",
            "O CCN1CCN",
            "O c7c8",
            "S 1",
            "S C1",
            "S CC1",
            "S c1ccccc1",
            "S c1ccccn1",
            "S c4ccccc4C3",
            "] /",
            "n 4",
            "n s",
            "n c2cc",
            "n c3c",
            "n nc1",
            "n c3ccccc23",
            "n 3c",
            "n cc4",
            "n c4c",
            "n c3cccc",
            "n o1",
            "n ccn",
            "n c4c5c",
            "n c3ccn",
            "n 7cnc",
            "n 8ccc",
            "n 9cnc",
            "o 2",
            "o 3",
            "o 6",
            "o c4",
            "o nc",
            "o c2ccccc12",
            "o c2cc",
            "o c4ccccc34",
            "o c2ccccc2c1",
            "s 2",
            "s 5",
            "s cc",
            "s c1",
            "s cn1",
            "s c3ccccc23",
            "s ccc3",
            "s c3c2",
            "CC S",
            "CC l",
            "CC 1C",
            "CC CCCNC",
            "CC c2ccccc2",
            "CC c2ccc",
            "CC c3ccccc3",
            "CC 3CC",
            "CC c3ccc",
            "CC O2",
            "CC c1cc2c",
            "CC OP",
            "CC Oc1cc",
            "CC n1cc",
            "CC c2ccc3c",
            "CC c1ccn",
            "CC c1ccccn1",
            "CC c2nn",
            "CC n3c",
            "cc 4C",
            "cc c2c1",
            "cc 2C1",
            "cc 86",
            "cc 9cc",
            "]( /",
            "NC 3",
            "NC 4",
            "NC P",
            "NC 2C",
            "NC c3ccccc3",
            "NC N2",
            "NC c3c",
            "NC 21",
            "NC c2ccc3c",
            "NC c4nc",
            "NC 2CCOCC2",
            "NC c2cccc3ccccc23",
            "c1 3",
            "c1 F",
            "c1 Cc1ccccc1",
            "c1 ccccc12",
            "c1 C2",
            "c1 Br",
            "c1 cn",
            "c1 NCCN",
            "c1 oc",
            "c1 oc2ccccc2c1",
            "c2 F",
            "c2 C1",
            "c2 C3",
            "c2 c3c",
            "c2 nc1",
            "c2 sc",
            "c2 O4",
            "c2 cc1O",
            "c2 cc1OC",
            "CCC 1",
            "CCC 3",
            "CCC c2ccccc2",
            "CCC c1ccc",
            "CCC n1",
            "CCC c1ccccc1",
            "CCC O2",
            "CCC c1c",
            "CCC OP",
            "CCC 2CCCCC2",
            "CCC ON",
            "CCC Sc1n",
            "CCC c5ccc",
            "CCC c1cn",
            "cccc 3",
            "cccc 1C",
            "cccc 12",
            "cccc c8",
            "cccc 2Cl",
            "cccc 45",
            "cccc 5n",
            "cccc 4F",
            "cccc 53",
            "OC 2",
            "OC 4",
            "OC O",
            "OC 6O",
            "OC 4O",
            "OC c2cc",
            "OC c3ccccc3",
            "OC 1CC",
            "OC 7O",
            "OC c3ccc",
            "OC c1cccc",
            "OC 2CC",
            "OC c3cc",
            "OC O2",
            "OC 2OC",
            "OC c4cc",
            "OC 3OC",
            "OC c1c",
            "OC 5OC",
            "OC O4",
            "OC c5ccccc5",
            "OC c2nc",
            "OC 6C",
            "OC O5",
            "OC Oc2n",
            "OC c2cn",
            "ccc 6",
            "ccc 3CC",
            "ccc 4F",
            "ccc 9O",
            "ccc 4N3",
            "CO 3",
            "CO 9",
            "CO c1cc2",
            "CO c2cccc3",
            "CO c2ccc3",
            "CO c1no",
            "CCCC 3",
            "CCCC l",
            "CCCC OC",
            "CCCC 1C",
            "CCCC NC1",
            "CCCC CC2",
            "CCCC OP",
            "CCCC c1oc2ccccc2c1",
            "Cc1 c2c",
            "Cc1 cc3",
            "Cc1 nc2",
            "Cc1 no",
            "c3 2",
            "c3 CO",
            "c3 Cl",
            "c3 n1",
            "c3 c2cc",
            "c3 n2",
            "c3 c4ccccc4",
            "c3 c1c",
            "c3 c1O",
            "c3 oc4c",
            "c3 c4c5c",
            "c3 OCC5",
            "c3 ns",
            "c3 sccc3",
            "c3 OC2OC",
            "CCCN c2ccccn2",
            "CCCN 2CCC",
            "CCCN 1c2cc",
            "1C 1",
            "1C NC",
            "1C OC",
            "1C 23C",
            "cc1 F",
            "cc1 S",
            "cc1 n",
            "cc1 OCc1ccccc1",
            "cc1 OCC1",
            "cc1 n3C",
            "CCCCN 2CCN",
            "CCCCN 1CCN",
            "2C 2",
            "2C 3C",
            "2C c3c",
            "2C N2CCC",
            "ccccc2 s1",
            "CNC c3cccc",
            "CNC 12CC",
            "CNC 1CC1",
            "CNC 7N",
            "c4 n",
            "c4 c5ccccc5",
            "c4 c3O",
            "c4 c3c2",
            "c2ccccc2 C",
            "c2ccccc2 F",
            "c2ccccc2 I",
            "c2ccccc2 S",
            "c2ccccc2 Cl",
            "c2ccccc2 n1",
            "c2ccccc2 s1",
            "c2ccccc2 o1",
            "cc2 c1",
            "cc2 cn",
            "cc2 o1",
            "cc2 c1OC",
            "cc2 c1s",
            "cc2 cc1OC",
            "c2ccc 3ccccc3c2",
            "c1ccc s1",
            "c1ccc o1",
            "nc nc",
            "nc n2",
            "nc 5C",
            "nc s1",
            "nc 5c",
            "3O 7",
            "Cc1ccccc1 Nc1nc",
            "Cc1c sc",
            "Cc1c scn1",
            "CCN CC",
            "CCN 2C",
            "CCN 5C",
            "CCN c1cccnc1",
            "CCN c3ccn",
            "CCN 4CCN",
            "CCN c3c4ccccc4",
            "CCN c4c5ccccc5",
            "CN 4CC",
            "CN c1n",
            "CN c1nc",
            "CN c2n",
            "CN 2C1",
            "CN 2CCCCC2",
            "CN 3CCC",
            "CN 2CCC",
            "CN 2CCCC2",
            "OCC 4",
            "OCC O2",
            "OCC c2nc",
            "OCC Oc3ccc",
            "OCC 1CN",
            "C1 2",
            "C1 O",
            "C1 c1ccc",
            "C1 NCC",
            "C1 Br",
            "C1 c1c",
            "1O P",
            "c2c 5c",
            "c2c oc",
            "c2c ncn2C",
            "N1 CCCC1",
            "NCC S",
            "NCC c1ccccc1",
            "NCC OCCOCC",
            "NCC c1cccnc1",
            "NCC n3",
            "NCC c3c2cc",
            "3C OC",
            "3C SSC",
            "n1 2",
            "n1 S",
            "n1 c",
            "n1 Cc1c",
            "c1cc c2ccc",
            "c1cc c2cc",
            "c1cc c2n",
            "c1cc 4ccccc4",
            "ccccc3 nc1",
            "CS c1cc",
            "CS c1n",
            "CS C1CC",
            "CS c1sc",
            "CC1 OC",
            "CC1 CC1",
            "CC1 c3c",
            "c1ccccc1 n2",
            "c1ccccc1 N3",
            "c1ccccc1 c2C1",
            "C2 CC2",
            "C2 4OC",
            "C2 3CC4CC",
            "C2 CC3CC"
        ]
    }
}